app/controllers/facts_controller.rb

  def index
    @facts = Fact.all
---
SELECT * FROM `facts`