app/controllers/onboard_controller.rb

  def index
    @onboard = Onboard.all
---
SELECT * FROM `onboards`