app/controllers/partners_controller.rb

SELECT * FROM `partners`
---
  def index
    @partners = Partner.all