app/controllers/pledges_controller.rb

  def index
    @pledges = Pledge.all
---
SELECT * FROM `pledges`