app/controllers/qantas_supporters_controller.rb

  def show
    @qantas_supporter = Supporter.find(params[:id])
---
SELECT * FROM `supporters` WHERE (`supporters`.`id` = 1)

  def index
    @qantas_supporter = Supporter.find(params[:id])
---
SELECT * FROM `supporters` WHERE (`supporters`.`id` = 1)