app/controllers/supermarkets_controller.rb

SELECT * FROM `supermarkets`
---
  def index
    @supermarkets = Supermarket.all