app/controllers/supporters_controller.rb

INSERT INTO `supporters` (`name`, `accept_more_info`, `created_at`, `postcode`, `updated_at`, `email`) VALUES('Glenn', 1, '2009-10-11 05:35:03', 1234, '2009-10-11 05:35:03', 'gm@aon.com.au')
---
  def create

    posted_supporter = params[:supporter]

    pledges = extract_pledges(posted_supporter)
    supermarkets = extract_supermarkets(posted_supporter)

    respond_to do | format |
      #if verify_recaptcha()

        supporter = Supporter.create!(posted_supporter)