app/controllers/whattobuy_controller.rb

  def index
    @whattobuy = Whattobuy.all
---
SELECT * FROM `whattobuys`